{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_290", "layers": [{"name": "input_307", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "input_307"}, "inbound_nodes": []}, {"name": "sequential_180", "class_name": "Sequential", "config": {"name": "sequential_180", "layers": [{"class_name": "Dense", "config": {"name": "dense_303", "trainable": true, "batch_input_shape": [null, 100], "dtype": "float32", "units": 16384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_83", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_274", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_99", "trainable": true, "dtype": "float32", "target_shape": [2, 32, 256]}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_100", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_84", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_275", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_188", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_101", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [2, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}]}, "inbound_nodes": [[["input_307", 0, 0, {}]]]}], "input_layers": [["input_307", 0, 0]], "output_layers": [["sequential_180", 1, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "dense_303/kernel", "shape": [100, 16384], "dtype": "float32"}, {"name": "dense_303/bias", "shape": [16384], "dtype": "float32"}, {"name": "batch_normalization_274/gamma", "shape": [16384], "dtype": "float32"}, {"name": "batch_normalization_274/beta", "shape": [16384], "dtype": "float32"}, {"name": "conv2d_transpose_100/kernel", "shape": [2, 5, 128, 256], "dtype": "float32"}, {"name": "conv2d_transpose_100/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_275/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_275/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_101/kernel", "shape": [2, 5, 1, 128], "dtype": "float32"}, {"name": "conv2d_transpose_101/bias", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_274/moving_mean", "shape": [16384], "dtype": "float32"}, {"name": "batch_normalization_274/moving_variance", "shape": [16384], "dtype": "float32"}, {"name": "batch_normalization_275/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_275/moving_variance", "shape": [128], "dtype": "float32"}]}]}